HAMES2-1st-3/TunnelComfortSystemTesting/include/tc27xb/IfxHssl_regdef.h
/** \\brief  Access Window Start Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_AW_AWSTART_Bits B;
} Ifx_HSSL_AW_AWSTART;

/** \\brief  Configuration Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_CFG_Bits B;
} Ifx_HSSL_CFG;

/** \\brief  Clock Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_CLC_Bits B;
} Ifx_HSSL_CLC;

/** \\brief  CRC Control Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_CRC_Bits B;
} Ifx_HSSL_CRC;

/** \\brief  Initiator Control Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_I_ICON_Bits B;
} Ifx_HSSL_I_ICON;

/** \\brief  Initiator Read Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_I_IRD_Bits B;
} Ifx_HSSL_I_IRD;

/** \\brief  Initiator Read Write Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_I_IRWA_Bits B;
} Ifx_HSSL_I_IRWA;

/** \\brief  Initiator Write Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_I_IWD_Bits B;
} Ifx_HSSL_I_IWD;

/** \\brief  Module Identification Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_ID_Bits B;
} Ifx_HSSL_ID;

/** \\brief  Initiator Stream Current Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_IS_CA_Bits B;
} Ifx_HSSL_IS_CA;

/** \\brief  Initiator Stream Frame Count Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_IS_FC_Bits B;
} Ifx_HSSL_IS_FC;

/** \\brief  Initiator Stream Start Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_ISSA_Bits B;
} Ifx_HSSL_ISSA;

/** \\brief  Kernel Reset Register 0 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_KRST0_Bits B;
} Ifx_HSSL_KRST0;

/** \\brief  Kernel Reset Register 1 */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_KRST1_Bits B;
} Ifx_HSSL_KRST1;

/** \\brief  Kernel Reset Status Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_KRSTCLR_Bits B;
} Ifx_HSSL_KRSTCLR;

/** \\brief  Miscellaneous Flags Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_MFLAGS_Bits B;
} Ifx_HSSL_MFLAGS;

/** \\brief  Miscellaneous Flags Clear Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_MFLAGSCL_Bits B;
} Ifx_HSSL_MFLAGSCL;

/** \\brief  Flags Enable Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_MFLAGSEN_Bits B;
} Ifx_HSSL_MFLAGSEN;

/** \\brief  Miscellaneous Flags Set Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_MFLAGSSET_Bits B;
} Ifx_HSSL_MFLAGSSET;

/** \\brief  OCDS Control and Status */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_OCS_Bits B;
} Ifx_HSSL_OCS;

/** \\brief  Request Flags Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_QFLAGS_Bits B;
} Ifx_HSSL_QFLAGS;

/** \\brief  Stream FIFOs Status Flags Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_SFSFLAGS_Bits B;
} Ifx_HSSL_SFSFLAGS;

/** \\brief  Target Current Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_T_TCA_Bits B;
} Ifx_HSSL_T_TCA;

/** \\brief  Target Current Data Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_T_TCD_Bits B;
} Ifx_HSSL_T_TCD;

/** \\brief  Target ID Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_TIDADD_Bits B;
} Ifx_HSSL_TIDADD;

/** \\brief  Target Stream Current Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_TS_CA_Bits B;
} Ifx_HSSL_TS_CA;

/** \\brief  Target Stream Frame Count Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_TS_FC_Bits B;
} Ifx_HSSL_TS_FC;

/** \\brief  Target Stream Start Address Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_TSSA_Bits B;
} Ifx_HSSL_TSSA;

/** \\brief  Target Status Register */
typedef union
{
    /** \brief Unsigned access */
    unsigned int U;
    /** \brief Signed access */
    signed int I;
    /** \brief Bitfield access */
    Ifx_HSSL_TSTAT_Bits B;
} Ifx_HSSL_TSTAT;
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Hssl_struct
 * \{  */
/******************************************************************************/
/** \name Object L1
 * \{  */

/** \\brief  Access window */
typedef volatile struct _Ifx_HSSL_AW
{
    Ifx_HSSL_AW_AWSTART AWSTART;            /**< \brief 0, Access Window Start Register */
    Ifx_HSSL_AW_AWEND AWEND;                /**< \brief 4, Access Window End Register */
} Ifx_HSSL_AW;

/** \\brief  Initiator */
typedef volatile struct _Ifx_HSSL_I
{
    Ifx_HSSL_I_IWD IWD;                     /**< \brief 0, Initiator Write Data Register */
    Ifx_HSSL_I_ICON ICON;                   /**< \brief 4, Initiator Control Data Register */
    Ifx_HSSL_I_IRWA IRWA;                   /**< \brief 8, Initiator Read Write Address Register */
    Ifx_HSSL_I_IRD IRD;                     /**< \brief C, Initiator Read Data Register */
} Ifx_HSSL_I;

/** \\brief  Initiator stream */
typedef volatile struct _Ifx_HSSL_IS
{
    Ifx_HSSL_ISSA SA[2];                    /**< \brief 0, Initiator Stream Start Address Register */
    Ifx_HSSL_IS_CA CA;                      /**< \brief 8, Initiator Stream Current Address Register */
    Ifx_HSSL_IS_FC FC;                      /**< \brief C, Initiator Stream Frame Count Register */
} Ifx_HSSL_IS;

/** \\brief  target */
typedef volatile struct _Ifx_HSSL_T
{
    Ifx_HSSL_T_TCD TCD;                     /**< \brief 0, Target Current Data Register */
    Ifx_HSSL_T_TCA TCA;                     /**< \brief 4, Target Current Address Register */
} Ifx_HSSL_T;

/** \\brief  Target stream */
typedef volatile struct _Ifx_HSSL_TS
{
    Ifx_HSSL_TSSA SA[2];                    /**< \brief 0, Target Stream Start Address Register */
    Ifx_HSSL_TS_CA CA;                      /**< \brief 8, Target Stream Current Address Register */
    Ifx_HSSL_TS_FC FC;                      /**< \brief C, Target Stream Frame Count Register */
} Ifx_HSSL_TS;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
/** \addtogroup IfxLld_Hssl_struct
 * \{  */
/******************************************************************************/
/** \name Object L0
 * \{  */

/** \\brief  HSSL object */
typedef volatile struct _Ifx_HSSL
{
    Ifx_HSSL_CLC CLC;                       /**< \brief 0, Clock Control Register */
    unsigned char reserved_4[4];            /**< \brief 4, \internal Reserved */
    Ifx_HSSL_ID ID;                         /**< \brief 8, Module Identification Register */
    Ifx_HSSL_CRC CRC;                       /**< \brief C, CRC Control Register */
    Ifx_HSSL_CFG CFG;                       /**< \brief 10, Configuration Register */
    Ifx_HSSL_QFLAGS QFLAGS;                 /**< \brief 14, Request Flags Register */
    Ifx_HSSL_MFLAGS MFLAGS;                 /**< \brief 18, Miscellaneous Flags Register */
    Ifx_HSSL_MFLAGSSET MFLAGSSET;           /**< \brief 1C, Miscellaneous Flags Set Register */
    Ifx_HSSL_MFLAGSCL MFLAGSCL;             /**< \brief 20, Miscellaneous Flags Clear Register */
    Ifx_HSSL_MFLAGSEN MFLAGSEN;             /**< \brief 24, Flags Enable Register */
    Ifx_HSSL_SFSFLAGS SFSFLAGS;             /**< \brief 28, Stream FIFOs Status Flags Register */
    unsigned char reserved_2C[4];           /**< \brief 2C, \internal Reserved */
    Ifx_HSSL_I I[4];                        /**< \brief 30, Initiator */
    Ifx_HSSL_T T[4];                        /**< \brief 70, target */
    Ifx_HSSL_TSTAT TSTAT;                   /**< \brief 90, Target Status Register */
    Ifx_HSSL_TIDADD TIDADD;                 /**< \brief 94, Target ID Address Register */
    unsigned char reserved_98[8];           /**< \brief 98, \internal Reserved */
    Ifx_HSSL_IS IS;                         /**< \brief A0, Initiator stream */
    Ifx_HSSL_TS TS;                         /**< \brief B0, Target stream */
    Ifx_HSSL_AW AW[4];                      /**< \brief C0, Access window */
    Ifx_HSSL_AR AR;                         /**< \brief E0, Access Rules Register */
    unsigned char reserved_E4[4];           /**< \brief E4, \internal Reserved */
    Ifx_HSSL_OCS OCS;                       /**< \brief E8, OCDS Control and Status */
    Ifx_HSSL_KRSTCLR KRSTCLR;               /**< \brief EC, Kernel Reset Status Clear Register */
    Ifx_HSSL_KRST1 KRST1;                   /**< \brief F0, Kernel Reset Register 1 */
    Ifx_HSSL_KRST0 KRST0;                   /**< \brief F4, Kernel Reset Register 0 */
    Ifx_HSSL_ACCEN1 ACCEN1;                 /**< \brief F8, Access Enable Register 1 */
    Ifx_HSSL_ACCEN0 ACCEN0;                 /**< \brief FC, Access Enable Register 0 */
    unsigned char reserved_100[768];        /**< \brief 100, \internal Reserved */
} Ifx_HSSL;
/** \}  */
/******************************************************************************/
/** \}  */
/******************************************************************************/
/******************************************************************************/
#endif /* IFXHSSL_REGDEF_H */
